Show / Hide Table of Contents
Interface IApplicationBIM
Abstraction of a FE application which provides data to Idea StatiCa
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[ServiceContract]
public interface IApplicationBIM
Methods
Improve this Doc   View Source
GetActiveSelection()
Declaration
[OperationContract]
List<BIMItemId> GetActiveSelection()
Returns
 Type |  Description
 System.Collections.Generic.List<BIMItemId>
Improve this Doc   View Source
GetActiveSelectionModelXML(CountryCode, RequestedItemsType)
Declaration
[OperationContract]
string GetActiveSelectionModelXML(CountryCode countryCode, RequestedItemsType requestedType)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
 RequestedItemsType |  requestedType
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetApplicationName()
Declaration
[OperationContract]
string GetApplicationName()
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetModelForSelectionXML(CountryCode, List<BIMItemsGroup>)
Declaration
[OperationContract]
string GetModelForSelectionXML(CountryCode countryCode, List<BIMItemsGroup> items)
Parameters
 Type |  Name |  Description
 CountryCode |  countryCode
 System.Collections.Generic.List<BIMItemsGroup> |  items
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
IsCAD()
Declaration
[OperationContract]
bool IsCAD()
Returns
 Type |  Description
 System.Boolean
Improve this Doc   View Source
SelectAsync(List<BIMItemId>)
Declaration
[OperationContract]
Task SelectAsync(List<BIMItemId> items)
Parameters
 Type |  Name |  Description
 System.Collections.Generic.List<BIMItemId> |  items
Returns
 Type |  Description
 System.Threading.Tasks.Task
 Improve this Doc
 View Source